# Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей. Дано a, b, c - стороны
# предполагаемого треугольника. Требуется сравнить длину каждого отрезка-стороны с суммой двух других. Если хотя бы
# в одном случае отрезок окажется больше суммы двух других, то треугольника с такими сторонами не существует.
# Отдельно сообщить является ли треугольник разносторонним, равнобедренным или равносторонним, только если
# треугольник существует .

a = 4
b = 5
c = 0

# Введите ваше решение ниже
if (a + b) > c and (a + c) > b and (b + c) > a:
    print('Треугольник существует')
    if a == b and a == c and b == c:
        print('Треугольник равносторонний')
    elif a != b and a != c and b != c:
        print('Треугольник разносторонний')
    else:
        print('Треугольник равнобедренный')
else:
    print('Треугольник не существует')